<template>
    <Loading v-if="loading"/>
    <div v-else class="">
        <div class="mb-36">
            <div dir='rtl' class="bg-purple-800 text-white p-4 w-11/12 m-auto mt-5 rounded-md load-component hover:box-shadow relative cursor-pointer" v-for="(message, index) in messages" @click="[message.isShow= true, message.seen = true]" v-click-outside="() => handleClickOutside(index)" :key="message.title + index" :style="'animation-delay: ' + 3*(index * 0.1) + 's'" >
                <p class="samim-font text-xl font-bold">{{ message['title'] }}</p>
                <div class="flex">
                    <p class="samim-font text-sm mt-3"> {{ !message.isShow ? message['contain'].slice(0, 50)+'...' : message.contain }} </p>
                </div>
                <IconNotification class="absolute top-4 left-2 w-7 h-7 animate-bounce" v-if="!message.seen"/>
            </div>
        </div>
    </div>
</template>

<script setup>
    import IconNotification from '@/components/icons/IconNotification.vue';
    import Loading from '@/components/Loading.vue';

    import { ref, onMounted, markRaw, nextTick } from 'vue';

    const loading = ref(false);

    const messages = ref({});
    messages.value = [
        {
            'title': 'خوش آمدید!',
            'contain': 'کاربر عزیز، سلام! به ربات دیجی نامبر خوش آمدید. ما از اینکه شما را در جمع خود داریم بسیار خوشحالیم. امیدواریم که تجربه کاربری شما با ربات ما لذت‌بخش و مفید باشد. در صورت داشتن هرگونه سوال یا نیاز به پشتیبانی، تیم ما همیشه آماده است تا به شما کمک کند.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'اطلاعیه جدید',
            'contain': 'کاربر گرامی، ما یک اطلاعیه مهم برای شما داریم. لطفاً توجه داشته باشید که تغییرات جدیدی در خدمات و امکانات ربات اعمال شده است. برای دریافت اطلاعات دقیق‌تر و جزئیات بیشتر، لطفاً به بخش اعلانات در ربات مراجعه کنید. امیدواریم این تغییرات به بهبود تجربه کاربری شما کمک کند.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'تایید حساب',
            'contain': 'حساب کاربری شما با موفقیت تایید شد. اکنون می‌توانید به تمامی امکانات و خدمات ربات دسترسی پیدا کنید. اگر نیاز به کمک بیشتری دارید یا سوالی دارید، لطفاً با تیم پشتیبانی ما تماس بگیرید. از شما بابت انتخاب ما سپاسگزاریم و امیدواریم که از خدمات ما رضایت کامل داشته باشید.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'تخفیف ویژه',
            'contain': 'خبر خوش! به مناسبت ویژه، تخفیف فوق‌العاده‌ای برای شما آماده کرده‌ایم. با استفاده از کد تخفیف اختصاصی که در این پیام درج شده است، می‌توانید از تخفیف ویژه بهره‌مند شوید. این فرصت را از دست ندهید و خرید خود را با قیمت‌های استثنایی انجام دهید. برای دریافت کد تخفیف و جزئیات بیشتر، لطفاً به پیام‌های بعدی توجه کنید.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'هشدار امنیتی',
            'contain': 'توجه! فعالیت‌های مشکوکی در حساب کاربری شما شناسایی شده است. به منظور حفظ امنیت حساب شما، لطفاً هر چه سریع‌تر رمز عبور خود را تغییر دهید. در صورت مشاهده هرگونه فعالیت غیرعادی یا نیاز به کمک، لطفاً با تیم پشتیبانی تماس بگیرید. امنیت حساب شما برای ما بسیار مهم است و تمام تلاش خود را برای حفاظت از اطلاعات شما انجام می‌دهیم.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'پیام پشتیبانی',
            'contain': 'تیم پشتیبانی ما به سوال یا درخواست شما پاسخ داده است. لطفاً به بخش پیام‌ها در ربات مراجعه کنید تا پاسخ کامل و اطلاعات لازم را دریافت کنید. اگر هنوز سوالی دارید یا به کمک بیشتری نیاز دارید، لطفاً با ما تماس بگیرید. ما همیشه آماده‌ایم تا به شما کمک کنیم و مشکلات شما را حل کنیم.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'به‌روزرسانی ربات',
            'contain': 'نسخه جدیدی از ربات دیجی نامبر منتشر شده است که شامل ویژگی‌ها و امکانات جدیدی است. با به‌روزرسانی به نسخه جدید، می‌توانید از قابلیت‌های بهبود یافته و امکانات اضافه شده بهره‌مند شوید. برای اطلاع از تغییرات و ویژگی‌های جدید، لطفاً به بخش به‌روزرسانی‌ها مراجعه کنید. امیدواریم که این تغییرات به بهبود تجربه کاربری شما کمک کند.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'پرداخت موفق',
            'contain': 'پرداخت شما با موفقیت انجام شد. فاکتور مربوط به خرید شما به ایمیل ثبت شده ارسال شده است. لطفاً برای بررسی جزئیات و اطلاعات بیشتر، ایمیل خود را چک کنید. اگر سوالی دارید یا نیاز به کمک بیشتری دارید، لطفاً با تیم پشتیبانی ما تماس بگیرید. از خرید شما سپاسگزاریم و امیدواریم که از خرید خود رضایت کامل داشته باشید.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'خروج از حساب',
            'contain': 'شما با موفقیت از حساب کاربری خود خارج شدید. اگر قصد ورود مجدد دارید، لطفاً اطلاعات ورود خود را وارد کنید. اگر به دلایل امنیتی یا مشکلات دیگر نیاز به تغییر رمز عبور یا تنظیمات حساب دارید، لطفاً با تیم پشتیبانی ما تماس بگیرید. ما همیشه آماده‌ایم تا به شما کمک کنیم و از تجربه کاربری شما اطمینان حاصل کنیم.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'نظر سنجی',
            'contain': 'ما به نظرات و پیشنهادات شما اهمیت می‌دهیم. لطفاً در نظرسنجی ما شرکت کنید و نظرات و پیشنهادات خود را با ما به اشتراک بگذارید. نظرات شما به ما کمک می‌کند تا خدمات خود را بهبود بخشیم و تجربه بهتری برای شما فراهم کنیم. از شما برای وقت و توجه‌تان سپاسگزاریم و منتظر دریافت نظرات شما هستیم.',
            'seen': false,
            'isShow': false
        },
        {
            'title': 'پیشنهاد ویژه',
            'contain': 'برای شما یک پیشنهاد ویژه داریم! با استفاده از این پیشنهاد منحصر به فرد، می‌توانید از تخفیف‌های ویژه و مزایای اضافی بهره‌مند شوید. این پیشنهاد فقط برای مدت محدود در دسترس است، بنابراین هرچه زودتر از آن استفاده کنید. برای جزئیات بیشتر و نحوه استفاده از این پیشنهاد، لطفاً به پیام‌های بعدی مراجعه کنید.',
            'seen': false,
            'isShow': false
        }
    ];

    const handleClickOutside = (key) => {
        messages.value[key].isShow = false;
    }

</script>